## Plan Result (shared-snowplow-consumer-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11806475777)



<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114
  * aws_sqs_queue.shared-event-consumer
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ",
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shared-snowplow-consumer-sns-sqs-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114 will be updated in-place
  ~ resource "aws_iam_policy" "shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114" {
        id               = "arn:aws:iam::996905175585:policy/SharedSnowplowConsumer-Prod-TaskRolePolicy"
        name             = "SharedSnowplowConsumer-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
                          - "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "SharedSnowplowConsumer"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.shared-event-consumer will be updated in-place
  ~ resource "aws_sqs_queue" "shared-event-consumer" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
        name                              = "SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue-DLQ"
              + maxReceiveCount     = 3
            }
        )
        tags                              = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "SharedSnowplowConsumer"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>







## :warning: Errors

* add a label shared-snowplow-consumer-cdk-production/add-or-update: POST https://api.github.com/repos/Pocket/pocket-monorepo/issues/948/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]


<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":948,"Program":"tfcmt","SHA1":"e3cf03a3a190bbc552957f69a1a0ac01dd6f4ce2","Target":"shared-snowplow-consumer-cdk-production","Vars":{},"WorkflowName":"Shared Snowplow Consumer"} -->